#include<stdio.h>
int main(){
    float f=12.5;
    int a=(int)f;    //强制类型转换 这样会损失精度0.5.
    printf("%d\n",a);
}
//强制类型转换 需要人工手动操作
//类型转换完之后向0取整 也就是舍弃小数部分
//一般是大类型转换为小类型 需要强制类型转换
//char 1byte=8bit 存储数为-128~127 = - 2^7~2^7-1
//short 2byte=16bit 存储数为-32768~32767 = - 2^15~2^15-1
//int 4byte=32bit 存储数为-2147483648~2147483647 = - 2^31~2^31-1
//long 8byte=64bit 存储数为-9223372036854775808~9223372036854775807 = - 2^63~2^63-1
//float 4byte=32bit 存储数为-3.4e38~3.4e38 = - 2^128~2^128-1
//double 8byte=64bit 存储数为-1.7e308~1.7e308 = - 2^1024~2^1024-1