//"&"按位与 "|"按位或 "^"按位异或 "~"按位取反 "<<"左移 ">>"右移 are bitwise operators in C.
//看竖式 
//"&" 同时为1才为1 有0则为0    "|"相同为1则为1 同时为0才为0    "^" 相同为0 不同为1    "~" 取反 单目运算符 把1变为0 把0变为1
//    0101 1010                  0101 1010                      0101 1010             0101 1010--1010 0101
//    0011 1101                  0011 1101                      0011 1101             0011 1101--1100 0010
//    0001 1000                  0111 1111                      0110 0111             
// "~5" 0000 0101取反为 1111 1010 为250 但是第一位是符号数为负数 1111 1010 取反为 0000 0101+1=0000 0110=6 所以为-6 取反加一在求补码或负转换为正
#include<stdio.h>
int main(){
    int num=10;          //10的二进制为0000 1010    即2^3+2^1=10
    int n=num<<1;        //左移运算符 10的二进制为0000 1010 左移1位为0001 0100 即 2^4+2^2=20 即左移一位相
                         //左移1位之后 右边空出来的位补0
    int m=num>>1;        //右移运算符 10的二进制为0000 1010 右移1位为0000 0101 即2^2+2^0=5 即右移一位相当于除以2
                         //右移1位之后 左边空出来的位补符号位
    int a=-1;
    int p=a>>1;          //右移运算符 -1的二进制为1111 1111 右移1位为1111 1111 最右边bu空出来的位补符号位 右移一位相当于除以2
    printf("n=%d\n",n);
    printf("m=%d\n",m);
    printf("p=%d\n",p);
    return 0;
}