//指针变量运算的本质：指针指向的是内存当中的地址，对指针进行加减整数运算，实际上是指针指向地址的相对偏移
#include<stdio.h>
int main(){
    int arr[5]={1,2,3,4,5};
    int* p=&arr[0];
    printf("%p\n",p);
    printf("%p\n",&arr[0]);
    printf("==============================\n");
    printf("%p\n",p+1);//地址与上方字节相差4 因为是整数类型 地址是十六进制
    printf("%p\n",&arr[1]);
    printf("===============================\n");
    printf("%d\n",*(p+2));
    printf("%d\n",arr[2]);
    return 0;
}
//结论：对于指针加整数n，字节数增加n*4(整数类型int 字节数)，如p+1，字节数加4。因为是十六进制，所以末尾是英文。如果是short类型 则n*2